1)  Почему использование тестовых заглушек может быть полезным при написании модульных тестов?

    Мой ответ: Тестовые заглушки позволяют изолировать тесты от его основного кода.

2) Какой тип тестовой заглушки следует использовать, если вам нужно проверить, что метод был вызван с определенными аргументами?

    Мой ответ: verify

3) Какой тип тестовой заглушки следует использовать, если вам просто нужно вернуть определенное значение или исключение в ответ на вызов метода?

    Мой ответ: when и thenReturn

4) Какой тип тестовой заглушки вы бы использовали для имитации  взаимодействия с внешним API или базой данных?

    Мой ответ: fake